# CannotPickHereInCurrentView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotPickHereInCurrentView Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't pick here at this view angle. Set another Work Plane or adjust the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPickHereInCurrentView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPickHereInCurrentView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPickHereInCurrentView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace